docs/developer/tests/load/load-test.yml
# Artillery Load Test Configuration for Cognitive Fabric Visualizer
# Tests API performance under various load conditions

config:
  target: 'http://localhost:3001'
  phases:
    # Warmup phase
    - duration: 60
      arrivalRate: 5
      name: "Warm up"

    # Ramp up phase
    - duration: 120
      arrivalRate: 5
      rampTo: 20
      name: "Ramp up load"

    # Sustained load phase
    - duration: 300
      arrivalRate: 20
      name: "Sustained load"

    # Peak load phase
    - duration: 120
      arrivalRate: 20
      rampTo: 50
      name: "Peak load"

    # Cool down phase
    - duration: 60
      arrivalRate: 10
      name: "Cool down"

  processor: "./load-test-processor.js"
  variables:
    authToken: "test-token-placeholder"

scenarios:
  # Health check load test
  - name: "Health Check Load"
    weight: 10
    flow:
      - get:
          url: "/health"
          expect:
            - statusCode: 200
            - hasProperty: "status"
            - hasProperty: "timestamp"

  # Authentication load test
  - name: "Authentication Load"
    weight: 15
    flow:
      - post:
          url: "/api/auth/login"
          json:
            email: "loadtest@example.com"
            password: "LoadTestPassword123!"
          expect:
            - statusCode: 200
            - hasProperty: "token"
          capture:
            - json: "$.token"
              as: "authToken"

  # Conversation listing load test
  - name: "Conversation List Load"
    weight: 20
    flow:
      - get:
          url: "/api/conversations"
          headers:
            Authorization: "Bearer {{ authToken }}"
          qs:
            page: 1
            limit: 10
          expect:
            - statusCode: 200
            - hasProperty: "data"
            - hasProperty: "pagination"

  # Conversation creation load test
  - name: "Conversation Creation Load"
    weight: 15
    flow:
      - post:
          url: "/api/conversations"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            title: "Load Test Conversation {{ $randomString() }}"
            participants: ["User1", "User2"]
            messages:
              - speaker: "User1"
                text: "This is a load test message {{ $randomString() }}"
                timestamp: "{{ $timestamp }}"
          expect:
            - statusCode: 201
            - hasProperty: "id"
          capture:
            - json: "$.id"
              as: "conversationId"

  # Analysis initiation load test
  - name: "Analysis Initiation Load"
    weight: 25
    flow:
      - post:
          url: "/api/analysis/conversations/{{ conversationId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            options:
              models: ["factual_retrieval", "logical_inference"]
              confidence_threshold: 0.7
          expect:
            - statusCode: 202
            - hasProperty: "analysis_id"
            - hasProperty: "status"

  # Visualization creation load test
  - name: "Visualization Creation Load"
    weight: 10
    flow:
      - post:
          url: "/api/visualizations/conversations/{{ conversationId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            type: "cognitive_graph"
            options:
              layout: "force_directed"
              color_scheme: "dimensional"
          expect:
            - statusCode: 201
            - hasProperty: "id"

  # Export request load test
  - name: "Export Request Load"
    weight: 5
    flow:
      - post:
          url: "/api/exports/conversations/{{ conversationId }}"
          headers:
            Authorization: "Bearer {{ authToken }}"
          json:
            format: "json"
            options:
              include_messages: true
              include_analysis: true
          expect:
            - statusCode: 202
            - hasProperty: "export_id"